flow-examples/class6/responseRead.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
   <soapenv:Body>
      <Entries xmlns="http://ws.wso2.org/dataservice">
         <Entry>
            <nome>fulano1</nome>
            <telefone>111111111</telefone>
            <cidade>Lisboa1</cidade>
            <pais>Portugal1</pais>
         </Entry>
      </Entries>
   </soapenv:Body>
</soapenv:Envelope>